%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @copyright (C) 2015, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 03. 六月 2015 下午6:10
%%%-------------------------------------------------------------------
-module(test_cmd).

-include("common.hrl").

%% API
-export([
	send/4
]).

%% ====================================================================
%% API functions
%% ====================================================================
send(PlayerId, Mod, Cmd, Data) ->
	PlayerPid = player_lib:get_player_pid(PlayerId),
	gen_server2:cast(PlayerPid, {'SOCKET_EVENT', Mod, Cmd, Data}).

%% ====================================================================
%% Internal functions
%% ====================================================================
