--
-- Author: 21102585@qq.com
-- Date: 2014-11-21 09:57:05
-- 战斗系统常量



DefBodyRect = cc.rect(0,0,100,200)

SceneRoleType = {
	PLAYER = 1,   --玩家
	PLAYERCOPY = 6,   --玩家镜像
	MONSTER = 2,   --怪物
	BOSS = 10,     --怪物Boss
	ITEM = 3,      --物品
	PET = 4,       --宠物
	FIREWALL = 5,  --火墙
	BABY = 100,    --baby
	NPC = 101,     --NPC
	SOLDIER = 120, --士兵类型

	COLLECTIONITEM = 7,      --采集物品
}

--角色动作规则
--图片命名 前三位是角色ID 第四位表示动作类型 五六表示序列针序号
-- 五个方向见 RoleDirect

RoleDirect = {
	DOWN = 1,--向下
	RIGHT_DOWM = 2,--r d
	RIGHR = 3, --r         
	RIGHT_UP = 4,--r u
	UP = 5, --u
	LEFT_UP = 4,--l u
	LEFT = 3,--l
	LEFT_DOWM = 2, --l d
}

FightAction = {
	STAND = "stand", --站立       #1
	ATTACK = "attack",--攻击      #3
	HURT = "hurt", --受击         #4
	RUN = "walk",--"run",--跑步   #2
	WALK = "walk", --走
	WIN = "win",--胜利            #
	DEAD = "dead",--死亡          #5
	ATTACK1 = "attack1", --特殊攻击1#
	ATTACK2 = "attack2", --特殊攻击2#
	ATTACK3 = "attack3", --特殊攻击3#
}

SceneGridAround = {{0,-1},{0,1},{-1,0},{1,0},{1,-1},{-1,-1},{-1,1},{1,1}}

--战斗阵营类型
FightGroupType = {
	ONE = 1,	--左边
	TWO = 2, 	--右边
}

--战斗时模型方向
FightDirectionType = {
	RIGHT = 1,
	LEFT = -1,
}

--角色格子数
RoleGridNum = {
	ONE = 1,
	TWO = 2,
	FOUR = 4,
}


RoleActivitStates = {
	STAND = "stand",--准备状态
	MOVE = "move",--移动状态
	PRE_ATTACK = "preattack",--攻击状态前期
	ATTACK = "attack",--攻击状态
	SPECIAL_ATTACK = "special_attack",--特殊技能，放大招
	DEAD = "dead", --死亡状态
	PAUSE = "pause",--暂停状态
	WIN = "win",--胜利状态
	NULL = "null", --空状态不做任何事情
	HURT = "hurt", --受击
}


--战斗攻击范围配置
--2表示1格内的,3表示1*2范围,4表示是1*3,5表示2*2,6表示3*3,7表示4*4,8表示全部,9闪电链
--右边
FightAtkRightRange = {
	[1] = {},
	[2] = {{0,0,1}},
	[3] = {{0,0,1},{1,0,2}},
	[4] = {{0,0,1},{1,0,2},{2,0,3}},
	[5] = {{0,0,1},{1,0,2},{0,1,2},{1,1,2}},
	[6] = {{0,0,1},{-1,-1,2},{0,-1,2},{1,-1,2},{1,0,2},{1,1,2},{0,1,2},{-1,1,2},{-1,0,2}},
	[7] = {{0,0,1},{0,-1,2},{0,1,2},{1,0,2},{1,1,2},{1,-1,2},{0,2,3},{0,-2,3},{2,0,3},{1,2,3},{1,-2,3},{2,-1,3},{2,1,3},{2,2,3},{2,-2,3},{0,3,4},{0,-3,4},{1,3,4},{1,-3,4},{2,3,4},{2,-3,4},{3,0,4},{3,-1,4},{3,1,4},{3,-2,4},{3,2,4},{3,3,4},{3,-3,4}},


}
--左边受攻击范围
FightAtkLeftRange = {
	[1] = {},
	[2] = {{0,0,1}},
	[3] = {{0,0,1},{-1,0,2}},
	[4] = {{0,0,1},{-1,0,2},{-2,0,3}},
	[5] = {{0,0,1},{-1,0,2},{-1,1,2},{0,1,2}},
	[6] = {{0,0,1},{-1,-1,2},{0,-1,2},{1,-1,2},{1,0,2},{1,1,2},{0,1,2},{-1,1,2},{-1,0,2}},
	[7] = {{0,0,1},{0,1,2},{0,-1,2},{-1,0,2},{-1,1,2},{-1,-1,2},{0,2,3},{0,-2,3},{-1,2,3},{-1,-2,3},{-2,2,3},{-2,-2,3},{-2,1,3},{-2,-1,3},{-2,0,3},{0,3,4},{0,-3,4},{-1,3,4},{-1,-3,4},{-2,3,4},{-2,-3,4},{-3,3,4},{-3,-3,4},{-3,2,4},{-3,-2,4},{-3,1,4},{-3,-1,4},{-3,0,4}},
}


