%%%-------------------------------------------------------------------
%%% @author zhengsiying
%%% @copyright (C) 2015, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 21. 七月 2015 下午4:40
%%%-------------------------------------------------------------------


%% 账号删除记录
-record(db_account, {
	open_id,
	player_id,
	platform,
	server_id
}).


%% ===================================================================
%% 金币消耗纪录
%% ===================================================================
-record(db_log_money, {
	player_id, %% 玩家id
	num, %% 数量
	current_num,    %%变化后的数量
	key, %% 3，金币
	type, %% 消耗的类型
	time %% 时间
}).

%% ===================================================================
%% 经验增加记录
%% ===================================================================
-record(db_log_exp, {
	id, %%
	player_id, %% 玩家id
	player_name, %% 角色名
	server_id, %% 区服
	exp, %% 增加的经验值
	old_exp, %% 原经验值
	new_exp, %% 新的经验值
	old_lv, %% 老等级
	new_lv, %% 新等级
	reason, %% 原因
	createtime, %% 时间
	message %% 额外信息
}).

%% ===================================================================
%% 纪录帐号删除
%% ===================================================================
-record(db_log_account, {
	player_id, %% 删除的玩家id
	open_id, %% 账号
	platform, %% 平台id
	time %% 删除时间
}).

%% ===================================================================
%% 聊天记录
%% ===================================================================
-record(db_log_chat, {
	id,%%主键
	player_id, %% 玩家id
	player_name, %% 昵称
	content, %% 聊天内容
	server_id, %% 服务器id
	createtime %% 时间
}).

%% ===================================================================
%% 死亡记录
%% ===================================================================
-record(db_log_dead, {
	id,%%主键
	player_id, %% 玩家id
	player_name, %% 昵称
	server_id, %% 服务器id
	createtime, %% 时间
	reason,        %%死亡原因,1玩家杀死，2怪物杀死
	scene_id    %%场景id
}).

%% ===================================================================
%% 交易记录
%% ===================================================================
-record(db_log_trade, {
	id,    %%主键
	player_id1, %% 玩家1,
	player_name1,    %%玩家1昵称
	goods_info1, %% 物品1
	jade1,        %%元宝1
	player_id2, %% 玩家2
	player_name2,    %%玩家2昵称
	goods_info2,    %% 物品2
	jade2,        %%元宝2
	server_id, %% 服务器id
	type,    %%交易类型，1交易所，2当面
	createtime    %%交易时间
}).

%% ===================================================================
%% 物品变化记录
%% ===================================================================
-record(db_log_goods, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	goods_id,    %% 物品id
	num,        %% 数量
	current_num,%% 当前数量
	reason,        %%原因
	createtime    %%交易时间
}).

%% ===================================================================
%% 物品属性变化记录
%% ===================================================================
-record(db_log_goods_attr, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	gid,        %%玩家物品id
	goods_id,    %% 物品id
	attrs_old,    %%旧属性
	attrs_new,    %%新属性
	reason,        %%原因
	createtime    %%时间
}).

%% ===================================================================
%% 战力变化记录
%% ===================================================================
-record(db_log_fight, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	reason,        %%原因:等级变，装备增减替换（翅膀，勋章）,强化洗炼，vip
	fight_old,    %%旧战力值
	fight_new,    %%新战力值
	attrs_old,    %%旧属性	{type,goods_id|goods_lv|goods_extra|level|vip_level
	attrs_new    %%新属性
}).

%% ===================================================================
%% 声望记录
%% ===================================================================
-record(db_log_reputation, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	reason,        %%原因:等级变，装备增减替换（翅膀，勋章）,强化洗炼，vip
	num,        %% 数量
	current_num    %% 当前数量
}).

%% ===================================================================
%% 掉落记录
%% ===================================================================
-record(db_log_drop, {
	id,    %%主键
	obj_id,    %% 怪物id
	obj_name,%%怪物名字
	server_id, %% 服务器id
	owner_id, %% 归属玩家id
	team_id, %% 归属队伍id
	createtime,    %%时间
	obj_type,    %%对像类型
	scene_id,    %%场景id,
	scene_name,    %%场景名称
	reason,        %%原因
	goods_id,    %% 物品id
	is_bind,    %%是否绑定
	num            %%物品数量
}).

%% ===================================================================
%% 登录退出记录
%% ===================================================================
-record(db_log_login, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	openid,        %%账号
	plat,        %%渠道
	server_id, %% 服务器id
	login_time,    %%登录时间
	logout_time,%%退出时间
	type        %%类型，0账号，1角色
}).

%% ===================================================================
%% 邮件记录
%% ===================================================================
-record(db_log_mail, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id,        %% 服务器id
	createtime,        %%时间
	mail_id = 0,    %%邮件id
	mail_type = 0,    %%邮件类型(0系统邮件1其他2全服邮件)
	sender = "",    %%发送者
	title = "",        %%标题
	content = "",    %%邮件内容
	award = [],        %%邮件奖励
	send_time = 0,    %%发送时间
	limit_time = 0    %%到期时间
}).


%% ===================================================================
%% 日常记录
%% ===================================================================
-record(db_log_daily, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	reason,        %%原因:任务名
	jade,        %%使用元宝数
	status    %%状态
}).

%% ===================================================================
%% boss击杀记录
%% ===================================================================
-record(db_log_monster_kill, {
	id,    %%主键
	monster_id, %% 怪物id,
	monster_name,    %%怪物名称
	server_id, %% 服务器id
	createtime,    %%时间
	scene_id,    %%场景id,
	scene_name,    %%场景名称
	begin_time,        %%开始时间
	duration        %%时长
}).

%% ===================================================================
%% 副本活动记录
%% ===================================================================
-record(db_log_instance_activity, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	scene_id,    %%场景id,
	scene_name,    %%场景名称
	enter_time,        %%开始时间
	exit_time,        %%结束时间
	duration        %%时长
}).

%% ===================================================================
%% 个人副本记录
%% ===================================================================
-record(db_log_instance_single, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	scene_id,    %%场景id,
	scene_name,    %%场景名称
	enter_time,        %%开始时间
	exit_time,        %%结束时间
	duration,        %%时长
	jade,            %%元宝数量
	completed        %%是否完成
}).

%% ===================================================================
%% 运营活动记录
%% ===================================================================
-record(db_log_activity, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	activity_id,    %%活动id,
	lv,    %%玩家级别
	vip        %%vip级别
}).

%% ===================================================================
%% 投保记录
%% ===================================================================
-record(db_log_insurance, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	goods_id,		%%物品id
	num,        %% 数量
	current_num    %% 当前数量
}).

%% ===================================================================
%% 一生一次购买记录
%% ===================================================================
-record(db_log_shop_once, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	server_id, %% 服务器id
	createtime,    %%时间
	goods_id,		%%物品id
	num,        %% 数量
	cost    %% 花费
}).

%% ===================================================================
%% boss刷新关注列表
%% ===================================================================
-record(db_player_monster_follow, {
	scene_id, %% 场景
	monster_id, %% 怪物id
	player_id, %% 玩家id
	open_id, %% 玩家账号
	channel %% 渠道
}).

%% ===================================================================
%% 玩家击杀boss掉落的物品
%% ===================================================================
-record(db_player_monster_drop, {
	id, %%
	player_id, %% 玩家id
	player_name, %% 玩家名称
	scene_id, %% 场景id
	monster_id, %% 怪物id
	monster_goods, %% 怪物掉落物品id列表
	add_time %% 添加时间
}).

%% ===================================================================
%% 游荡boss最后的击杀者
%% ===================================================================
-record(db_player_monster_killer_last, {
	monster_id, %% 怪物id
	player_name, %% 玩家名字
	update_time %%  更新时间
}).

%% ===================================================================
%% 跨服登录退出记录
%% ===================================================================
-record(db_log_login_cross, {
	id,    %%主键
	player_id, %% 玩家,
	player_name,    %%玩家昵称
	openid,        %%账号
	plat,        %%渠道
	server_id, %% 服务器id
	login_time,    %%登录时间
	logout_time,%%退出时间
	type        %%类型，0账号，1角色
}).

%% ===================================================================
%% 批量处理任务
%% ===================================================================
-record(db_player_batch_record, {
	player_id,	%%玩家id
	task_id,	%%任务id
	add_time %%  添加时间
}).