-- 自动生成，请勿修改 
-- 时间：2016/10/12
-- 21102585@qq.com

local guild_activeConfig = class("guild_activeConfig")
function guild_activeConfig:ctor()
	self.fields = {"key", "is_push", "open_limit", "enter_limit", "open_type", "open_week", "open_time", "close_time", "count_type", "limit_count", "enter_instance", "sub_instance"}
	self.datas = {
		[1] = {1, 1, {}, {}, 1, {1,2,3,4,5,6,7}, "{13,0,0}", "{13,30,0}", "day", 1, 20300, {}},
		[2] = {2, 1, {}, {}, 1, {1,2,3,4,5,6,7}, "{13,0,0}", "{13,30,0}", "day", 1, 20301, {}},
		[3] = {3, 1, {}, {}, 1, {1,2,3,4,5,6,7}, "{13,0,0}", "{13,30,0}", "day", 1, 20302, {}},
		[4] = {4, 0, {}, {}, 1, {1,2,3,4,5,6,7}, "{14,00,0}", "{23,30,0}", "day", 1, 20303, {20305,20306}},
		[5] = {5, 0, {}, {}, 1, {1,2,3,4,5,7}, {}, {}, "week", 3, 20304, {}},
		[6] = {6, 1, {}, {}, 1, {1,2,3,4,5,6,7}, "{13,0,0}", "{13,30,0}", "day", 1, 20307, {}},
		[7] = {7, 1, {}, {}, 1, {1,2,3,4,5,6,7}, "{13,0,0}", "{13,30,0}", "day", 1, 20308, {}},

	}
end
return guild_activeConfig
