-- 自动生成，请勿修改 
-- 时间：2016/10/12
-- 21102585@qq.com

local holidays_activeConfig = class("holidays_activeConfig")
function holidays_activeConfig:ctor()
	self.fields = {"active_type", "active_name", "active_rule", "goods_show", "rewards"}
	self.datas = {
		[4] = {4, "新春狂欢", "<font color='f4e6d5' size='16' opacity='255'>1.活动内，玩家击杀蜈蚣洞及野猪洞中的怪物会获得积分,小怪1点积分、精英怪及巨型多角冲及巨型钳虫20点积分、击杀触龙神和白野猪600点积分，达到普通积分要求立即发送邮件奖励；</font><br/><font color='f4e6d5' size='16' opacity='255'>2.玩家积分达到5000后可以进入排行榜；排名奖励会在活动结束后发送。</font>", "", {{1,"第一名",{{110163,1,2},{110109,1,2},{110260,1,20},{110102,1,5}}},{2,"第二名",{{110163,1,1},{110109,1,1},{110147,1,1},{110101,1,5}}},{3,"第三名",{{110054,1,5},{110109,1,1},{110101,1,5},{110260,1,10}}},{4,"2000积分",{{110099,1,5},{110054,1,5},{110152,1,10},{110193,1,10}}},{5,"1000积分",{{110149,1,1},{110152,1,5},{110003,1,15},{110007,1,5}}},{6,"500积分",{{110152,1,5},{110260,1,1},{110003,1,10},{110056,1,5}}}}},
		[5] = {5, "新春换礼", "<font color='ffffff' size='16' opacity='255'>1.活动期间内，玩家击杀蜈蚣洞和野猪洞中的怪物及boss有几率掉落活动道具金鸡、灯笼、爆竹；</font><br/><font color='ffffff' size='16' opacity='255'>2.收集活动道具可兑换节日礼包。</font><br/><font color='ffffff' size='16' opacity='255'>3.按钮下方会显示可兑换次数，兑换次数每日刷新。</font>", {110312,110313,110314}, {{1,260,10},{2,261,5},{3,262,2}}},

	}
end
return holidays_activeConfig
