-- 自动生成，请勿修改 
-- 时间：2017/01/17
-- 21102585@qq.com

local loadingtextConfig = class("loadingtextConfig")
function loadingtextConfig:ctor()
	self.fields = {"id", "text"}
	self.datas = {
		[1] = {1, "白日门内的虎卫堂里有强力的可诱惑怪物喔"},
		[2] = {2, "道士和法师的召唤物可以通过杀怪来提升等级"},
		[3] = {3, "暂时不用的贵重物品可以存放到仓库里"},
		[4] = {4, "可以通过点击世界地图进行快速传送"},
		[5] = {5, "每天会赠送快速挂机次数，不要忘记使用喔"},
		[6] = {6, "挂机系统开启后，不在线也会一直获得挂机收益"},
		[7] = {7, "高级世界BOSS有机会掉落特戒"},
		[8] = {8, "每天在行会捐献可以获得行会贡献"},
		[9] = {9, "幸运值+9可以使每次攻击都达到最大值"},
		[10] = {10, "使用一键完成日常任务和功勋任务可以获得额外收益"},
		[11] = {11, "可以在自动喝药设置里设定手动使用瞬回药"},
		[12] = {12, "打造金牛装备时会完全继承强化等级和完全返还铸魂精华"},
		[13] = {13, "周常任务是每周日晚上凌晨更新"},
		[14] = {14, "深海迷宫及以上地图会掉落特殊部位的装备"},
		[15] = {15, "分解装备会100%返还强化石和铸魂精华"},
		[16] = {16, "不清楚角色属性作用的可以点击角色界面的问号帮助按钮"},
		[17] = {17, "洗炼装备时使用洗炼锁可以固定属性,更加方便获得想要的属性"},
		[18] = {18, "游戏里所有怪物都有几率掉落不绑定的元宝"},

	}
end
return loadingtextConfig
