-- 自动生成，请勿修改 
-- 时间：2016/10/12
-- 21102585@qq.com

local lottery_carnivalConfig = class("lottery_carnivalConfig")
function lottery_carnivalConfig:ctor()
	self.fields = {"vip_lv", "price", "most_coin", "btn_des", "tips"}
	self.datas = {
		[1] = {1, 50, 100, "本次消耗50元宝", "成为VIP1可以获得1次抽奖机会"},
		[2] = {2, 100, 200, "本次消耗100元宝", "成为VIP2可以获得1次抽奖机会"},
		[3] = {3, 200, 400, "本次消耗200元宝", "成为VIP3可以获得1次抽奖机会"},
		[4] = {4, 400, 800, "本次消耗400元宝", "成为VIP4可以获得1次抽奖机会"},
		[5] = {5, 800, 1600, "本次消耗800元宝", "成为VIP5可以获得1次抽奖机会"},
		[6] = {6, 1000, 2000, "本次消耗1000元宝", "成为VIP6可以获得1次抽奖机会"},
		[7] = {7, 1500, 3000, "本次消耗1500元宝", "成为VIP7可以获得1次抽奖机会"},
		[8] = {8, 2000, 4000, "本次消耗2000元宝", "成为VIP8可以获得1次抽奖机会"},
		[9] = {9, 3000, 6000, "本次消耗3000元宝", "成为VIP9可以获得1次抽奖机会"},
		[10] = {10, 5000, 10000, "本次消耗5000元宝", "成为VIP10可以获得1次抽奖机会"},

	}
end
return lottery_carnivalConfig
