-- 自动生成，请勿修改 
-- 时间：2016/10/12
-- 21102585@qq.com

local npcfunctionConfig = class("npcfunctionConfig")
function npcfunctionConfig:ctor()
	self.fields = {"id", "btnlab", "desc", "win", "param"}
	self.datas = {
		[1] = {1, "进入挂机", "挂机界面", "", "hangUp"},
		[2] = {2, "装备强化", "装备界面", "equipStrengWin"},
		[3] = {3, "装备洗炼", "装备界面", "equipWin"},
		[4] = {4, "进入仓库", "仓库界面", "storageWin"},
		[5] = {5, "买武器", "买武器", "npcBuyWin"},
		[6] = {6, "买衣服", "买衣服", "npcBuyWin"},
		[7] = {7, "买首饰", "买首饰", "npcBuyWin"},
		[8] = {8, "买药品", "买药品", "npcBuyWin"},
		[9] = {9, "矿洞", "传送", "", "moveTo，103"},
		[10] = {10, "买技能书", "买技能书", "npcBuyWin"},
		[11] = {11, "进入二层", "进入二层"},
		[12] = {12, "进入三层", "进入三层"},
		[13] = {13, "进入购买", "云游商人", "npcBuyWin"},
		[14] = {14, "金条兑换(需要1000000金币和20元宝)", "是否消费1000000金币和20元宝兑换1条金条", "tips", 106},
		[15] = {15, "金砖兑换(需要5根金条)", "是否消耗5根金条兑换成1块金砖", "tips", 107},
		[16] = {16, "买羽毛", "买羽毛", "npcBuyWin"},
		[17] = {17, "进入火龙神殿2层", "进入火龙神殿2层", "needGoods", "31003_110224_10"},
		[18] = {18, "进入火龙神殿3层", "进入火龙神殿3层", "needGoods", "31004_110224_10"},
		[19] = {19, "进入神秘探宝", "打开神秘探宝", "treasureWin"},
		[20] = {20, "进入火龙神殿1层", "进入火龙神殿1层", "needGoods", "31002_0_0"},
		[21] = {21, "进入BOSS之家2层", "进入boss之家2层", "needVip", "32102_5"},
		[22] = {22, "进入BOSS之家3层", "进入boss之家3层", "needVip", "32103_7"},
		[23] = {23, "进入火龙神殿2层", "进入火龙神殿2层", "needGoods", "32110_110224_10"},
		[24] = {24, "进入火龙神殿3层", "进入火龙神殿3层", "needGoods", "32111_110224_10"},
		[25] = {25, "进入BOSS之家4层", "进入boss之家4层", "needVip", "32116_9"},
		[26] = {26, "进入变异地宫2层", "进入变异地宫2层", "killBossNum", "32122_2_32123"},
		[27] = {27, "进入变异地宫3层", "进入变异地宫3层", "killBossNum", "32123_2_32124"},
		[28] = {28, "进入变异地宫4层", "进入变异地宫4层", "killBossNum", "32124_2_32125"},

	}
end
return npcfunctionConfig
