-- 自动生成，请勿修改 
-- 时间：2016/10/12
-- 21102585@qq.com

local scene_transportConfig = class("scene_transportConfig")
function scene_transportConfig:ctor()
	self.fields = {"key", "name", "sceneId", "x", "y"}
	self.datas = {
		[101] = {101, "新手村", 20101, 52, 23},
		[102] = {102, "比奇城", 20100, 69, 58},
		[103] = {103, "沙巴克", 20015, 80, 64},
		[104] = {104, "矿洞", 20201, 8, 14},
		[105] = {105, "沃玛", 20204, 19, 15},
		[106] = {106, "尸王殿（剧情）", 20401, 21, 14},
		[107] = {107, "沃玛教主（剧情）", 20402, 24, 15},
		[108] = {108, "骷髅精灵(剧情)", 20405, 21, 14},
		[109] = {109, "精英沃玛(剧情)", 20406, 24, 15},
		[110] = {110, "巨型多角虫(剧情）", 20407, 22, 19},
		[111] = {111, "触龙神(剧情）", 20408, 22, 19},
		[112] = {112, "擂台(行会）", 21000, 16, 10},
		[113] = {113, "擂台(行会）", 21001, 16, 10},
		[114] = {114, "擂台(行会）", 21002, 16, 10},

	}
end
return scene_transportConfig
