-- 自动生成，请勿修改 
-- 时间：2016/10/12
-- 21102585@qq.com

local word_mapConfig = class("word_mapConfig")
function word_mapConfig:ctor()
	self.fields = {"id", "icon_x", "icon_y", "name", "name_color", "lv_label", "lv_color", "scene_id", "icon", "limit_text"}
	self.datas = {
		[1] = {1, 137, 121, "王城", "61e657", "", "", 20100,"wm_wangcheng"},
		[2] = {2, 225, 77, "古杏村", "61e657", "", "", 20101,"wm_xinshoucun"},
		[3] = {3, 237, 214, "土城", "61e657", "", "", 20102,"wm_tucheng"},
		[4] = {4, 630, 341, "白日天门", "61e657", "", "", 20103,"wm_brtm"},
		[5] = {5, 362, 223, "沙漠皇城", "ee0e01", "", "", 20015,"wm_shamohuangcheng"},
		[6] = {6, 272, 430, "沧月岛", "61e657", "", "", 20105,"wm_cangyue"},
		[7] = {7, 160, 20, "骷髅洞", "ffaa16", "10~20级", "61e657", 20201,"wm_guaiwu"},
		[8] = {8, 90, 212, "奥玛寺庙", "ffaa16", "20~30级", "61e657", 20204,"wm_guaiwu"},
		[9] = {9, 93, 334, "蜈蚣洞", "ffaa16", "30~40级", "61e657", 20207,"wm_guaiwu"},
		[10] = {10, 202, 289, "野猪洞", "ffaa16", "40~50级", "61e657", 20210,"wm_guaiwu"},
		[11] = {11, 390, 291, "祖玛地宫", "ffaa16", "50~60级", "61e657", 20213,"wm_guaiwu"},
		[12] = {12, 520, 292, "丛林迷宫", "ffaa16", "60~70级", "61e657", 20216,"wm_guaiwu"},
		[13] = {13, 562, 443, "深海迷宫", "ffaa16", "70~80级", "61e657", 20234,"wm_guaiwu"},
		[14] = {14, 390, 443, "牛魔寺庙", "ffaa16", "80~90级", "61e657", 20237,"wm_guaiwu"},

		[15] = {15, 527, 175, "雪域魔境", "ffaa16", "90~100级", "61e657", 20243, "wm_guaiwu","由于雪域魔境里怪物过于强劲，在本服务器完成首次合服后才会开启."},
		[16] = {16, 684, 129, "魔龙岭", "ffaa16", "100~110级", "61e657", 32118, "wm_guaiwu","等级不足，无法进入"},

	}
end
return word_mapConfig
